// data.js - 殿堂入り曲を手動でどんどん追加してください！
const HALL_OF_FAME = [
  {
    sm: "sm15630734",
    tags: ["2011年", "黒うさP", "初音ミク", "千本桜","神話入り"]
  },
  {
    sm: "sm1097445",
    tags: ["2007年", "ika-mo", "初音ミク", "みくみくにしてあげる♪【してやんよ】","神話入り"]
  },
  {
    sm: "sm1715919",
    tags: ["2007年", "ryo", "初音ミク", "メルト","神話入り"]
  },
  {
    sm: "sm10759623",
    tags: ["2010年", "wowaka", "初音ミク","巡音ルカ", "ワールズエンド・ダンスホール","神話入り"]
  },
  {
    sm: "sm11809611",
    tags: ["2010年", "ハチ", "初音ミク","GUMI", "マトリョシカ","神話入り"]
  },
  {
    sm: "sm31791630",
    tags: ["2017年", "wowaka", "初音ミク", "アンノウン・マザーグース","神話入り"]
  },
  {
    sm: "sm9714351",
    tags: ["2010年", "wowaka", "初音ミク", "ローリンガール","神話入り"]
  },
  {
    sm: "sm11398357",
    tags: ["2010年", "DECO*27", "GUMI", "モザイクロール","神話入り"]
  },
  {
    sm: "sm24276234",
    tags: ["2014年", "Orangestar", "IA", "アスノヨゾラ哨戒班","神話入り"]
  },
  {
    sm: "sm27965309",
    tags: ["2016年", "DECO*27", "初音ミク", "ゴーストルール","神話入り"]
  },
  {
    sm: "sm31606995",
    tags: ["2017年", "ハチ", "初音ミク", "砂の惑星","伝説入り最速曲","神話入り"]
  },
  {
    sm: "sm17520775",
    tags: ["2012年", "kemu", "IA", "六兆年と一夜物語","神話入り"]
  },
  {
    sm: "sm14583646",
    tags: ["2011年", "164", "GUMI", "天ノ弱","神話入り"]
  },
  {
    sm: "sm22138447",
    tags: ["2013年", "ハチ", "GUMI", "ドーナツホール","神話入り"]
  },
  {
    sm: "sm22960446",
    tags: ["2014年", "ナブナ", "初音ミク", "ウミユリ海底譚","神話入り"]
  },
  {     
    sm: "sm2937784",     
    tags: ["2008年", "cosMo@暴走P", "暴走P","初音ミク", "初音ミクの消失(LONG VERSION)","神話入り"]   
  },
  {     
    sm: "sm19133907",     
    tags: ["2012年", "れるりり", "初音ミク","GUMI", "脳漿炸裂ガール","神話入り"]   
  },
  {     
    sm: "sm31685272",     
    tags: ["2017年", "DECO*27", "初音ミク", "ヒバナ","神話入り"]   
  },
  {     
    sm: "sm8082467",     
    tags: ["2009年", "wowaka", "初音ミク", "裏表ラバーズ","神話入り"]   
  },
  {     
    sm: "sm6666016",     
    tags: ["2009年", "doriko","初音ミク", "ロミオとシンデレラ","神話入り"]   
  },
  {     
    sm: "sm3504435",     
    tags: ["2008年", "ryo", "初音ミク", "ワールドイズマイン","神話入り"]   
  },
{     
  sm: "sm39257413",     
  tags: ["2021年", "いよわ", "可不", "きゅうくらりん","神話入り"]   
},
{     
  sm: "sm32798041",     
  tags: ["2018年", "みきとP", "鏡音リン", "ロキ","神話入り"]   
},
{     
  sm: "sm33624822",     
  tags: ["2018年", "かいりきベア", "v_flower", "ベノム","神話入り"]   
},
{     
  sm: "sm8089993",     
  tags: ["2009年", "iroha", "鏡音リン", "炉心融解","神話入り","再投稿"]   
},
{     
  sm: "sm38833751",     
  tags: ["2021年", "ツミキ", "可不", "フォニイ","神話入り"]   
},
{     
  sm: "sm20244918",     
  tags: ["2013年", "Neru", "鏡音リン", "ロストワンの号哭","神話入り"]   
},
{     
  sm: "sm39334235",     
  tags: ["2021年", "ピノキオピー", "初音ミク", "神っぽいな","伝説入り"]   
},
{     
  sm: "sm15751190",     
  tags: ["2011年", "じん(自然の敵P)", "初音ミク", "カゲロウデイズ","伝説入り"]   
},
{     
  sm: "sm30177801",     
  tags: ["2016年", "ナユタン星人", "初音ミク", "ダンスロボットダンス","伝説入り"]   
},
{     
  sm: "sm43708803",     
  tags: ["2024年", "サツキ", "初音ミク","重音テト","SynthesizerV", "メズマライザー","伝説入り"]   
},
{     
  sm: "sm13386216",     
  tags: ["2011年", "ハチ", "GUMI", "パンダヒーロー","伝説入り"]   
},
{     
  sm: "sm36053074",     
  tags: ["2019年", "john", "初音ミク", "春嵐","伝説入り"]   
},
{     
  sm: "sm28576299",     
  tags: ["2016年", "ナユタン星人", "初音ミク", "エイリアンエイリアン","伝説入り"]   
},
{     
  sm: "sm29822304",     
  tags: ["2016年", "バルーン", "v_flower", "シャルル","伝説入り"]   
},
{     
  sm: "sm24643818",     
  tags: ["2014年", "Crusher-P", "GUMI", "ECHO","伝説入り"]   
},
{     
  sm: "sm3645817",     
  tags: ["2008年", "ryo", "初音ミク", "ブラック★ロックシューター","伝説入り"]   
},
{     
  sm: "sm37287661",     
  tags: ["2020年", "Kanaria", "GUMI", "KING","伝説入り"]   
},
{     
  sm: "sm31533883",     
  tags: ["2017年", "Omoi", "初音ミク", "テオ","伝説入り"]   
},
{     
  sm: "sm39608927",     
  tags: ["2021年", "ぬゆり", "v_flower", "ロウワー","伝説入り"]   
},
{     
  sm: "nm6049209",     
  tags: ["2009年", "アゴアニキ","巡音ルカ", "ダブルラリアット","伝説入り"]   
},
{     
  sm: "sm34470195",     
  tags: ["2019年", "DECO*27", "初音ミク", "乙女解剖","伝説入り"]   
},
{     
  sm: "sm39217773",     
  tags: ["2021年", "柊マグネタイト", "可不", "マーシャル・マキシマイザー","伝説入り"]   
},
{     
  sm: "sm18623327",     
  tags: ["2012年", "みきとP", "鏡音リン","GUMI", "いーあるふぁんくらぶ","伝説入り"]   
},
{     
  sm: "sm37198038",     
  tags: ["2020年", "稲葉曇", "歌愛ユキ", "ラグトレイン","伝説入り"]   
},
{     
  sm: "sm12825985",     
  tags: ["2010年", "Easypop","巡音ルカ","GUMI", "ハッピーシンセサイザ","伝説入り"]   
},
{     
  sm: "sm18406343",     
  tags: ["2012年", "じん(自然の敵P)", "IA", "チルドレンレコード","伝説入り"]   
},
{     
  sm: "sm30067009",     
  tags: ["2016年", "DECO*27", "初音ミク", "妄想感傷代償連盟","伝説入り"]   
},
{     
  sm: "sm30156654",     
  tags: ["2016年", "Orangestar", "IA", "DAYBREAK FRONTLINE","伝説入り"]   
},
{     
  sm: "sm37441963",     
  tags: ["2020年", "かいりきベア", "初音ミク", "ダーリンダンス","伝説入り"]   
},
{     
  sm: "sm33510542",     
  tags: ["2018年", "ギガ", "鏡音リン","鏡音レン", "劣等上等","伝説入り"]   
},
{     
  sm: "sm34425299",     
  tags: ["2019年", "syudou", "初音ミク", "ビターチョコデコレーション","伝説入り"]   
},
{     
  sm: "sm24892241",     
  tags: ["2014年", "ナブナ", "初音ミク", "夜明けと蛍","伝説入り"]   
},
{     
  sm: "sm15172108",     
  tags: ["2011年", "Mitchie M", "初音ミク", "FREELY TOMORROW","伝説入り"]   
},
{     
  sm: "sm14330479",     
  tags: ["2011年", "wowaka", "初音ミク", "アンハッピーリフレイン","伝説入り"]   
},
{     
  sm: "sm15022913",     
  tags: ["2011年", "40㍍P", "初音ミク", "からくりピエロ","伝説入り"]   
},
{     
  sm: "sm7550182",     
  tags: ["2009年", "ハチ", "初音ミク", "結ンデ開イテ羅刹ト骸","伝説入り"]   
},
{     
  sm: "sm38387707",     
  tags: ["2021年", "DECO*27", "初音ミク", "ヴァンパイア","伝説入り"]   
},
{     
  sm: "sm10393864",     
  tags: ["2010年", "DECO*27", "GUMI", "弱虫モンブラン","伝説入り"]   
},
{     
  sm: "sm32492001",     
  tags: ["2017年", "ココアシガレットP", "琴葉茜","結月ゆかり","弦巻マキ","東北きりたん", "Seyana.","何でも言うことを聞いてくれるアカネチャン","伝説入り"]     
},
{     
  sm: "sm29081909",     
  tags: ["2016年", "Neru", "鏡音レン", "脱法ロック","伝説入り"]   
},
{     
  sm: "sm30469574",     
  tags: ["2017年", "ナユタン星人", "初音ミク", "太陽系デスコ","伝説入り"]   
},
{     
  sm: "sm30105817",     
  tags: ["2016年", "かいりきベア", "初音ミク", "アルカリレットウセイ","伝説入り"]   
},
{     
  sm: "sm32727744",     
  tags: ["2018年", "ユリイ・カノン", "GUMI", "だれかの心臓になれたなら","伝説入り"]   
},
{     
  sm: "sm28276238",     
  tags: ["2016年", "くらげP", "結月ゆかり", "チュルリラ・チュルリラ・ダッダッダ！","伝説入り"]   
},
{     
  sm: "sm982882",     
  tags: ["2007年", "Otomania", "初音ミク","VOCALOIDカバー曲", "Ievan Polkka","伝説入り"]   
},
{     
  sm: "sm17720979",     
  tags: ["2012年", "Last Note.", "GUMI", "セツナトリップ","伝説入り"]   
},
{     
  sm: "sm6119955",     
  tags: ["2009年", "samfree","巡音ルカ", "ルカルカ★ナイトフィーバー","伝説入り"]   
},
{     
  sm: "sm20470051",     
  tags: ["2013年", "じん(自然の敵P)", "IA", "ロスタイムメモリー","伝説入り"]   
},
{     
  sm: "sm20116702",     
  tags: ["2013年", "じん(自然の敵P)", "IA", "夜咄ディセイブ","伝説入り"]   
},
{     
  sm: "sm43083649",     
  tags: ["2023年", "吉田夜世", "重音テト", "オーバーライド","伝説入り"]   
},
{     
  sm: "sm34871494",     
  tags: ["2019年", "かいりきベア", "鳴花ミコト", "アンヘル","伝説入り"]   
},
{     
  sm: "sm10444862",     
  tags: ["2010年", "Junky", "鏡音リン", "メランコリック","伝説入り"]   
},
{     
  sm: "sm1639267",     
  tags: ["2007年", "シンP", "KAITO","MEIKO","初音ミク", "卑怯戦隊うろたんだー","伝説入り"]   
},
{     
  sm: "sm42585649",     
  tags: ["2023年", "原口沙輔", "重音テト", "人マニア","伝説入り"]   
},
  // ここに100曲でも1000曲でも追加していくだけ！
];
